## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_iam_policy.ai-answers-ssm-policy`                 |
|        | `aws_iam_policy_attachment.ai-answers-ssm-policy`      |
|        | `aws_iam_role.ai-answers-ecs-role`                     |
|        | `aws_iam_role_policy_attachment.ai-answers-ecs-policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_policy.ai-answers-ssm-policy will be created
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_policy" "ai-answers-ssm-policy" {
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn              = (known after apply)
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + attachment_count = (known after apply)
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description      = "Policy for AI Answers to access SSM parameters"
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id               = (known after apply)
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name             = "ai-answers-ssm-policy"
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix      = (known after apply)
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path             = "/"
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy           = jsonencode(
[0;90m00:48:19.428[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = [
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ssm:GetParametersByPath",
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ssm:GetParameters",
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ssm:GetParameter",
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        ]
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = [
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "arn:aws:ssm:ca-central-1:992382783569:parameter/docdb_username",
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "arn:aws:ssm:ca-central-1:992382783569:parameter/docdb_password",
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "",
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        ]
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Sid      = "AllowSSMParameterAccess"
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_id        = (known after apply)
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags             = {
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m00:48:19.429[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all         = {
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_policy_attachment.ai-answers-ssm-policy will be created
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_policy_attachment" "ai-answers-ssm-policy" {
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id         = (known after apply)
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name       = "ai-answers-ssm-policy"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_arn = (known after apply)
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + roles      = [
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ai-answers-ecs-role",
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role.ai-answers-ecs-role will be created
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role" "ai-answers-ecs-role" {
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                   = (known after apply)
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assume_role_policy    = jsonencode(
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action    = "sts:AssumeRole"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect    = "Allow"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Principal = {
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Service = "ecs-tasks.amazonaws.com"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m00:48:19.430[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + create_date           = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_detach_policies = false
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                    = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + managed_policy_arns   = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_session_duration  = 3600
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                  = "ai-answers-ecs-role"
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix           = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path                  = "/"
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all              = {
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + unique_id             = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inline_policy (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy_attachment.ai-answers-ecs-policy will be created
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy_attachment" "ai-answers-ecs-policy" {
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id         = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role       = "ai-answers-ecs-role"
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 4 to add, 0 to change, 0 to destroy.
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_role_ai-answers-ecs-role_arn = (known after apply)
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m00:48:19.431[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m00:48:19.432[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ai-answers-ecs-role"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
